package com.pracktic.yogaspirit.data.consts;

public enum WarnArticles {

    LEVEL1("Свежий ум. Когда вы долго бьетесь над задачей, устали, а нужное решение не приходит, поможет эта медитация. Упражнение активизирует оба полушария, помогая им работать вместе. \n" +
            "\n" +
            "Сядьте удобно. Сожмите правую руку в кулак, вытяните указательный палец и зажмите им правую ноздрю. Дышите только левой ноздрей полторы минуты или дольше. \n" +
            "\n" +
            "Теперь зажмите левой рукой левую ноздрю, продолжайте столько же, сколько в первый раз. Выдохните и расслабьтесь.\n" +
            "\n" +
            "В этой медитации важно дышать медленно и глубоко. Старайтесь вдыхать животом, а потом наполнять воздухом легкие. На выдохе, наоборот, сначала выпускайте воздух из легких, а в конце — из живота. "),

    LEVEL2("Хорошее настроение. Эта медитация пригодится, если вас одолевают мрачные мысли, все кажется унылым и безрадостным. \n" +
            "\n" +
            "Сядьте удобно. Сложите ладони перед собой в виде чаши — правая на левой. Глаза чуть приоткрыты, взгляд на ладони.\n" +
            "\n" +
            "Вдохните через нос, сформулируйте негативные мысли и чувства, которые вами владеют. Ненадолго задержите дыхание, а потом с силой выдохните через рот весь негатив на свои ладони. \n" +
            "\n" +
            "В завершение вдохните и задержите дыхание, напрягая все мышцы тела. Потом выдохните и расслабьтесь."),
    LEVEL3("Эмоциональный баланс. Иногда мы так встревожены, рассержены или обижены, что не можем овладеть собой — и тут уж совсем не до работы. Простая медитация поможет успокоиться. \n" +
            "\n" +
            "Сначала выпейте полный стакан воды — это тоже часть медитации. Когда вы восстанавливаете водный баланс в организме, стресс сразу же уменьшается.\n" +
            "\n" +
            "Перекрестите руки на груди, кисти поместите под мышки. Убедитесь, что голова не наклонена, подбородок слегка подтянут к шее. Поднимите плечи и все время тяните их к ушам. \n" +
            "\n" +
            "Закройте глаза, дышите спокойно. В таком положении дыхание автоматически замедляется и к вам возвращается эмоциональный баланс. В конце просто расслабьтесь."),
    LEVEL4("Антимедитация, или медитация с лотосом. Бывает, что внимание ускользает и рассеивается, а в голове крутятся навязчивые мысли. В таком случае попробуйте соединить ладони в виде лотоса и изо всех сил не медитировать. Это положение рук поможет замедлиться и прояснить то, что кажется запутанным и сложным. \n" +
            "\n" +
            "Сядьте удобно. Сложите руки в лотос: соедините основания ладоней, кончики мизинцев и больших пальцев.\n" +
            "\n" +
            "Держите лотос на уровне лица примерно в 15 сантиметрах от него, локти расслабьте. \n" +
            "\n" +
            "Закройте глаза и делайте все возможное, чтобы не медитировать. Думайте о коллегах, срочных задачах, домашних делах, покупках, ремонте… Чем активнее вы думаете, тем сильнее эффект. Если ничего не приходит в голову, вспоминайте таблицу умножения или стихи. Дышите спокойно через нос. \n" +
            "\n" +
            "В завершение вдохните и задержите дыхание, напрягая все мышцы тела. Потом выдохните и расслабьтесь."),
    LEVEL5("Концентрация. Эта медитация помогает сфокусироваться и успокоить блуждающий ум, когда предстоит сложная работа, а времени мало. \n" +
            "\n" +
            "Сядьте удобно и закройте глаза. Широко откройте рот и давите кончиком языка на центр верхнего нёба. Дышите через нос, как обычно. В завершение сделайте вдох, закройте рот. Выдохните и расслабьтесь.\n" +
            "\n" +
            "Эффект от этой медитации усилится, если глаза будут приоткрыты и вы будете смотреть на кончик носа.");

    public final String text;
     WarnArticles(String text){
        this.text = text;
    }
}
